. 107193
i 80466
and 70083
the 68864
to 63292
, 56172
a 44948
my 31771
was 28190
is 25049
for 24903
in 24279
of 23111
! 22163
that 20357
me 18721
they 18427
you 17999
have 17730
it 16630
with 16551
this 14974
n't 12723
not 12385
he 11856
on 11306
had 11050
she 10875
are 10402
so 9855
at 9706
but 9584
be 8693
's 8621
very 8521
do 8435
an 8430
as 8289
dr. 7936
been 7738
if 7243
her 6937
`` 6926
all 6815
about 6585
there 6415
when 6371
out 6160
get 5966
from 5831
did 5807
doctor 5802
just 5639
) 5631
your 5438
time 5436
after 5416
what 5340
we 5327
has 5214
or 5213
office 5136
( 5135
up 5132
his 5085
no 5066
here 4995
staff 4966
will 4734
their 4691
them 4609
would 4539
were 4516
place 4336
can 4261
because 4219
've 4164
appointment 4117
one 4060
... 4057
see 3968
only 3909
by 3906
am 3897
who 3700
dr 3654
him 3640
back 3607
go 3484
'm 3430
more 3387
told 3367
? 3363
then 3272
going 3217
could 3192
great 3168
over 3118
also 3069
now 3037
which 3027
other 3020
even 3010
pain 2942
how 2937
like 2897
never 2872
any 2800
went 2799
well 2751
said 2723
always 2644
some 2632
know 2610
care 2609
called 2571
patients 2521
work 2495
really 2466
before 2448
than 2423
patient 2334
good 2327
friendly 2214
got 2207
need 2193
people 2191
years 2189
doctors 2183
wait 2170
call 2156
minutes 2134
insurance 2080
- 2061
again 2059
being 2042
2 2010
make 2006
day 1984
massage 1983
help 1967
made 1960
best 1956
asked 1944
does 1937
seen 1830
take 1797
few 1790
since 1778
clinic 1764
$ 1763
nice 1751
first 1740
our 1727
professional 1708
took 1701
way 1696
still 1655
want 1643
needed 1641
give 1632
another 1627
able 1596
find 1590
say 1587
found 1574
amazing 1568
3 1567
ever 1564
should 1555
feel 1550
practice 1547
treatment 1546
experience 1541
most 1541
& 1522
: 1520
much 1514
too 1513
visit 1507
into 1485
left 1476
room 1475
new 1465
right 1458
come 1443
off 1424
through 1416
came 1416
're 1415
same 1398
why 1397
love 1394
while 1394
where 1376
getting 1371
better 1357
hours 1352
5 1338
ca 1332
done 1309
health 1296
having 1291
hour 1275
physical_therapy 1256
both 1221
down 1212
actually 1189
everyone 1181
doing 1174
these 1172
tell 1172
facility 1166
times 1163
think 1159
us 1145
waiting 1144
medical 1144
kind 1139
rude 1134
helpful 1127
therapy 1125
clean 1120
anyone 1120
without 1117
issues 1117
appointments 1114
service 1105
person 1095
family 1087
recommend 1080
long 1073
life 1066
looking 1063
thank 1059
nurse 1053
highly_recommend 1052
bad 1047
results 1046
location 1040
needs 1040
saw 1034
week 1032
questions 1029
gave 1022
try 1021
today 1020
everything 1011
money 1004
caring 999
check 997
lot 996
little 993
review 991
months 991
nothing 990
body 990
weeks 984
things 978
waited 976
once 974
days 974
someone 967
many 965
problem 964
two 959
seeing 957
knowledgeable 955
each 952
awesome 950
until 949
put 946
received 935
home 934
pt 933
pay 928
different 921
happy 914
around 914
surgery 912
finally 905
something 901
ask 897
wanted 889
wonderful 888
anything 884
10 875
let 873
front_desk 871
phone 868
helped 859
issue 855
such 852
working 850
felt 839
husband 835
4 833
sure 832
business 832
schedule 825
walk 825
; 820
'd 814
keep 808
definitely 808
almost 804
every 803
sent 800
however 799
far 799
during 794
'll 793
enough 792
1 790
thought 788
treated 775
last 771
year 770
wrong 765
son 761
leave 746
prescription 735
tried 735
hospital 732
past 727
extremely 724
takes 723
team 722
trying 721
name 717
due 716
receptionist 714
easy 713
neck 713
bill 713
injury 710
already 708
coming 705
thorough 703
talk 698
excellent 696
chiropractor 686
therapist 684
waiting_room 680
started 676
30 676
understand 672
pa 669
use 667
worked 666
may 664
look 664
exercises 663
referred 661
used 660
decided 659
myself 658
urgent_care 656
thanks 655
makes 651
paperwork 639
reason 636
gone 632
given 631
within 624
horrible 624
area 623
own 620
least 618
reviews 617
stars 614
sick 614
visits 614
physical 610
problems 604
follow 603
several 603
thing 602
walked 601
point 598
worst 597
office_staff 597
treat 590
run 589
chiropractic 587
full 584
nurses 584
daughter 584
completely 584
its 579
wo 576
busy 574
6 571
feel_like 571
listen 570
gym 569
next 569
month 568
feeling 568
less 567
those 565
instead 565
services 564
15 563
making 560
taking 559
first_time 558
concerns 556
front 554
absolutely 554
-- 553
wife 552
appt 548
hard 546
later 544
make_sure 543
job 543
comfortable 539
quick 536
end 535
longer 535
recommended 534
plan 534
truly 533
believe 530
answer 530
away 526
unprofessional 522
yet 520
meds 518
explained 517
doc 517
seem 514
medication 513
billing 511
' 510
part 506
20 504
information 504
medicine 492
shoulder 491
physician 491
especially 487
whole 487
customer_service 487
pretty 486
bit 485
lady 485
quickly 484
friends 482
treatments 481
scheduled 481
continue 477
paid 477
maybe 477
tests 476
seems 476
test 473
saying 473
super 471
knew 471
open 470
taken 469
friend 467
fact 467
hold 467
works 465
overall 464
worth 464
guy 462
start 460
number 458
class 458
set 457
knee 457
vegas 456
referral 456
session 455
even_though 455
couple 452
half 451
door 450
usually 449
moved 449
change 448
every_time 447
etc 446
close 445
quite 444
fantastic 443
probably 443
return 441
knows 441
process 438
second 437
read 437
recently 437
talking 431
immediately 431
speak 431
charge 430
come_back 429
old 426
please 426
possible 425
therapists 425
seemed 425
spent 424
impressed 424
though 423
met 423
glad 422
terrible 421
beyond 420
send 419
attention 419
recovery 417
late 417
rehab 417
er 417
fine 416
high 416
available 415
deal 415
massages 414
kept 410
top 410
personal 409
offer 405
hands 405
might 404
arrived 403
% 401
twice 401
center 399
wait_time 397
gets 397
yes 397
would_recommend 395
giving 395
trust 394
says 394
others 394
mom 393
blood 392
comes 392
hope 392
expect 392
wish 390
exam 389
short 389
big 388
course 387
min 387
either 387
go_back 387
ended 386
stay 386
kids 385
hand 384
listens 383
pleasant 383
ok 382
showed 381
prior 381
helping 380
man 380
classes 380
sessions 379
small 378
knowledge 378
under 378
morning 378
mind 378
back_pain 376
free 374
happened 373
foot 372
fill 371
explain 371
attentive 370
waste 369
level 367
looked 367
specialist 367
quality 367
fast 366
lab 366
telling 365
first_visit 364
positive 364
symptoms 363
45 362
early 362
normal 362
yelp 362
condition 361
provide 360
real 359
book 358
entire 356
system 355
case 354
calling 353
order 353
complete 352
calls 352
show 352
disappointed 352
efficient 351
scheduling 351
woman 348
changed 347
pharmacy 347
injuries 346
receive 345
regular 345
minute 345
attitude 345
relief 344
totally 342
sports 341
answered 341
sit 341
checked 340
soon 340
places 338
blood_work 338
mins 337
running 336
message 336
goes 336
yourself 336
drive 334
oh 334
avoid 333
sometimes 333
cares 331
healthcare 331
guys 330
100 329
town 328
plus 328
assistant 327
star 326
prescriptions 326
important 326
serious 325
physical_therapist 323
rather 322
unfortunately 321
total 320
side 319
training 318
worse 318
write 317
insurance_company 316
live 316
next_day 316
previous 316
situation 315
although 314
mri 313
hear 313
online 313
heard 312
doctors_office 311
provider 311
listened 310
prescribed 310
adjustments 309
lack 308
three 308
8 307
seriously 307
amount 306
asking 305
personable 304
question 304
sign 304
rest 304
provided 302
leaving 301
company 300
adjustment 300
extra 299
guess 299
based 298
night 296
clearly 294
studio 294
equipment 293
x-rays 292
sitting 292
would_highly_recommend 291
response 291
spine 289
matter 289
call_back 288
convenient 287
huge 287
wellness 287
clients 286
using 286
above 286
new_patient 284
literally 284
warm 283
form 283
filled 283
girl 283
incredibly 282
fix 282
x-ray 281
chiropractors 281
lost 281
concern 281
die 281
las 280
muscle 280
paying 280
highly 280
muscles 280
type 280
covered 279
welcoming 278
program 278
cost 278
face 277
shot 277
stuff 277
simple 277
compassionate 277
between 276
offices 275
often 275
advice 274
manager 273
head 273
bring 273
mother 271
grateful 271
line 271
email 271
walking 271
understanding 271
brought 271
years_ago 269
felt_like 269
state 269
groupon 269
price 269
healthy 268
multiple 268
yoga 265
pressure 265
respect 263
pleased 263
atmosphere 263
hurt 263
und 263
ridiculous 262
called_back 261
poor 261
progress 261
charged 261
exactly 260
7 260
offered 260
refused 260
along 259
joke 259
move 259
experiences 259
finding 258
child 258
sweet 257
cause 257
idea 257
informed 256
sorry 256
options 256
following 255
rooms 255
knowledgable 254
hip 254
simply 254
spend 254
gives 253
weight 252
water 252
exercise 251
low 251
much_better 251
clear 251
supposed 251
remember 251
right_away 250
fun 250
heart 250
true 249
diagnosis 249
house 248
correct 248
experienced 248
physicians 248
spoke 248
ready 248
procedure 248
healing 246
ago 245
young 245
future 244
must 244
approach 244
accident 244
stop 243
negative 242
unless 241
concerned 241
refill 241
fee 241
request 240
health_care 239
address 239
gotten 239
rushed 238
food 238
appreciate 238
anymore 237
general 237
visited 237
long_time 237
sat 235
front_desk_staff 235
mention 235
including 233
behind 233
contact 232
pilates 232
massage_therapist 232
lobby 231
booked 231
valley 230
cared 230
appointment_time 230
difference 229
relaxing 229
actual 228
ease 228
wait_times 227
steve 227
environment 227
cold 227
answers 227
wants 227
new_doctor 226
front_office 226
four 225
further 225
desk 224
office_manager 224
moving 223
talked 223
children 222
emergency 221
dealing 220
building 220
owner 219
loved 219
okay 219
group 219
specific 218
pcp 217
membership 217
records 217
painful 216
sense 216
upon 216
turned 216
mean 216
rush 215
basically 215
40 215
together 214
update 213
family_doctor 213
meet 213
car_accident 213
areas 213
school 213
apparently 212
workout 212
50 212
leg 211
25 210
outstanding 210
pick 210
severe 209
choice 209
difficult 209
history 208
whatever 208
courteous 208
diagnosed 208
two_weeks 207
routine 207
arm 207
providers 207
phoenix 206
necessary 206
additional 206
list 206
willing 205
incompetent 205
reasonable 204
accommodating 204
ankle 204
lower_back 204
honestly 204
smile 204
enjoy 204
returned 203
feel_better 203
rmt 203
tells 203
ahead 203
cancel 202
baby 201
going_back 201
primary_care 201
walk-in 200
turn 200
fit 200
greeted 200
.. 199
scottsdale 199
assistants 199
awful 199
spa 199
im 199
payment 198
opinion 197
happen 197
ladies 197
dad 197
incredible 197
forever 196
itself 196
girls 196
mentioned 196
outside 196
came_back 196
note 195
initial 195
noticed 195
visiting 195
cover 195
copay 194
improvement 194
broken 194
ordered 194
perfect 193
referrals 193
feet 193
wow 193
obviously 192
another_doctor 191
personally 191
chronic 191
feel_comfortable 191
figure 191
medications 191
highly_recommended 191
miss 191
coming_back 191
labs 191
great_experience 189
bed 189
great_doctor 188
family_practice 188
lots 188
practices 188
bedside_manner 188
yesterday 187
strength 187
honest 186
chance 186
dont 185
improved 185
first_appointment 185
polite 185
testing 184
improve 184
stated 184
website 184
means 184
compassion 183
professionalism 183
straight 183
treating 183
would_never 182
sleep 182
stretches 182
despite 181
hate 181
special 181
upset 181
facilities 180
regarding 180
az 180
reception 179
90 179
fixed 179
major 179
monday 179
injured 179
range 179
sad 179
moment 178
post 178
entire_staff 178
phone_call 177
effective 177
gentle 177
continued 177
floor 177
anyway 177
employees 177
machine 176
signed 176
take_care 176
reschedule 176
reading 176
world 176
pain_free 176
returning 175
surgeon 175
none 175
billed 175
get_back 174
suggested 174
u 174
info 174
whether 174
accept 174
stopped 174
receptionists 173
balance 173
complaint 172
could_give 172
year_old 172
drs 172
saturday 171
active 171
option 171
private 171
great_job 170
arizona 170
blood_pressure 170
closed 170
stay_away 169
front_office_staff 169
discuss 169
surprised 169
several_times 168
requested 168
mine 168
student 168
stress 168
md 168
expected 168
become 167
ones 167
daily 167
began 167
required 167
antibiotics 167
experiencing 166
else 166
thinking 166
helps 166
prices 166
elsewhere 166
policy 166
certain 166
nurse_practitioner 165
explaining 165
space 165
skin 165
checking 165
knowing 165
taken_care 164
co-pay 164
exam_room 164
wrote 164
notice 164
np 164
earlier 163
genuine 163
12 163
skills 163
site 163
clinics 163
last_time 162
hot 162
infection 162
techniques 162
drug 162
choose 161
zero 161
costs 161
cool 161
spot 161
client 161
heal 160
specialists 160
interested 160
human 160
uncomfortable 160
ich 160
cash 159
manner 159
letter 159
missed 159
near 158
refer 158
nearly 158
followed 158
relaxed 158
various 158
parking 158
mistake 157
suffering 157
music 157
lunch 157
writing 157
chris 157
addition 156
rate 156
medical_care 156
pain_management 156
save 155
pains 155
customer 155
procedures 155
individual 155
top_notch 155
proper 155
competent 155
messages 154
considering 154
lucky 154
learn 154
went_back 154
many_years 154
known 153
satisfied 153
friday 153
women 152
word 152
shoulders 152
ultrasound 151
injections 151
test_results 151
touch 151
expensive 151
mail 151
primary_care_physician 151
energy 150
thankful 150
crazy 149
throughout 149
great_place 149
current 149
acupuncture 149
chose 149
five 148
large 148
excited 148
release 148
push 148
research 148
liked 148
words 148
ran 147
properly 147
paper 147
main 147
months_ago 147
receiving 147
weekend 147
complaints 146
chiropractic_care 146
handle 146
conversation 146
across 146
became 145
eye 145
family_medicine 145
step 145
look_forward 145
car 145
stand 145
date 144
scott 144
informative 144
bikram 144
fitness 144
per 144
refills 144
instructors 144
network 144
nor 143
long_wait 143
core 143
nervous 143
fully 143
basic 143
friendly_staff 143
listening 142
two_hours 142
students 142
himself 142
agree 142
learned 142
forms 142
motion 142
file 142
looks 141
suggest 141
chiro 141
realized 141
result 141
really_nice 141
caused 141
father 141
specifically 141
skilled 141
refund 141
card 141
say_enough 141
der 141
every_single 140
starting 140
computer 140
physio 140
genuinely 140
beginning 140
24 140
changes 140
beautiful 140
living 140
advance 139
feels 139
imagine 139
allowed 139
consider 139
tech 139
strong 139
hung 139
plenty 139
treatment_plan 138
sore 138
pediatrician 138
changing 138
phone_calls 137
funny 137
confident 137
communication 137
currently 137
easily 137
related 136
pocket 136
go_see 136
table 136
many_times 136
located 136
levels 136
exceptional 136
light 135
forward 135
shows 135
toronto 135
consultation 135
themselves 135
matt 135
9 134
inside 134
posture 134
prescribe 134
addressed 134
evaluation 134
age 134
certainly 133
account 133
add 133
third 133
treats 132
standard 132
several_years 132
expertise 132
detail 132
bother 132
shots 132
made_sure 131
management 131
one_star 131
barely 131
physical_therapists 131
opened 130
discomfort 130
ear 130
headaches 130
normally 130
cancer 130
mark 130
desert 130
primary_care_doctor 130
super_friendly 129
share 129
could_get 129
medical_assistant 129
really_like 129
asks 129
lose 129
med 129
last_year 129
needless 128
really_good 128
deep 128
massage_therapy 128
favorite 127
days_later 127
benefits 127
# 127
keeping 127
street 127
road 127
hit 126
finished 126
two_years 126
decision 126
forgot 126
stretching 126
forget 125
organized 125
david 125
surprise 125
putting 125
vitals 125
fairly 125
primary 124
unable 124
voice 124
laura 124
get_better 124
watch 124
beware 124
written 124
60 123
rehabilitation 123
figured 123
definitely_recommend 123
story 123
except 123
chandler 123
professionals 123
umc 123
trainer 123
charges 123
doubt 122
meeting 122
would_definitely_recommend 122
causing 122
fax 122
provides 122
ist 122
das 122
standing 121
locations 121
contacted 121
medical_records 121
via 121
needing 120
1/2 120
ma 120
dollars 120
nerve 120
emergency_room 120
george 120
billing_department 120
wasted 119
kim 119
realize 119
would_give 119
common 119
second_time 119
counter 119
support 119
happens 118
pm 118
adams 118
booking 118
happier 118
field 118
arrive 118
value 118
particular 118
waiting_area 118
someone_else 118
sister 118
urgent 117
sort 117
would_call 117
condescending 117
tension 117
cut 117
nobody 117
generally 117
focus 117
flexible 117
cancelled 117
bunch 116
frustrated 116
bills 116
surgeries 116
claim 116
welcome 115
fair 115
last_week 115
truly_cares 115
pills 115
didnt 115
till 115
ensure 115
advised 114
directly 114
afternoon 114
prepared 114
hell 114
favor 114
ability 114
trip 114
weird 114
initially 114
slow 114
script 114
goals 114
typical 113
six 113
aware 113
flu 113
stuck 113
folks 113
1st 113
begin 113
docs 113
office_visit 113
mobility 113
rx 113
finish 112
adjusted 112
herself 112
game 112
tv 112
fall 112
cant 112
cough 112
correctly 112
constantly 112
fault 112
self 112
switch 112
decent 112
banner 112
female 112
sharma 112
neck_pain 112
jim 112
absolute 111
hair 111
previously 111
feeling_better 111
annual 111
wonder 111
trouble 111
great_care 111
saved 111
ten 111
playing 110
never_felt 110
shocked 110
would_like 110
likely 110
reasons 110
eric 110
unlike 110
massage_therapists 110
nicht 110
immediate 110
whenever 109
drugs 109
dealt 109
affordable 109
mike 109
athlete 109
another_appointment 109
middle 109
turns 109
three_times 109
member 109
allow 109
modern 109
loves 109
gilbert 109
credit 109
track 108
seeking 108
double 108
department 108
interest 108
perhaps 108
athletes 108
variety 108
bought 108
mostly 108
city 108
offers 108
boyfriend 108
pretty_much 108
single 108
joint 107
play 107
period 107
bone 107
encountered 107
technique 107
one_time 107
lol 107
possibly 107
tight 107
kid 107
shape 106
eyes 106
pass 106
break 106
knots 106
switched 106
minor 106
anxiety 106
julie 106
physically 106
aches 105
minutes_later 105
regularly 105
recent 105
recommendation 105
practitioner 105
great_staff 105
rating 105
report 105
answering 105
illness 105
numerous 105
deserve 104
seek 104
effort 104
started_going 104
alone 104
agreed 104
prompt 104
impossible 104
mess 104
follow-up 104
voicemail 103
two_days 103
unnecessary 103
chest 103
chart 103
providing 103
nursing 103
keeps 103
older 103
physiotherapy 103
speech 103
ways 103
transferred 103
expectations 102
assured 102
instructor 102
against 102
hopefully 102
explanation 102
monthly 102
urine 102
customers 102
health_insurance 102
boothe 102
fan 101
access 101
excuse 101
passed 101
spends 101
average 101
involved 101
wanting 101
natural 101
completed 101
direct 101
recover 101
tempe 101
stronger 101
ill 101
importantly 100
diagnose 100
best_doctor 100
dental 100
examination 100
frustrating 100
purchased 100
allergies 100
front_staff 100
chair 100
removed 100
lab_results 100
lab_work 99
reach 99
techs 99
eat 99
calm 99
lower_back_pain 99
bathroom 99
orthopedic 99
2nd 99
pregnancy 98
parents 98
shame 98
benefit 98
search 98
would_get 98
blue 98
disease 98
legs 98
dirty 98
taught 98
one_day 98
towards 98
rarely 98
broke 98
migraines 98
page 97
leaves 97
smart 97
tired 97
good_doctor 97
placed 97
yeah 97
personality 97
art 97
miles 97
appreciated 97
finally_got 97
assessment 97
pregnant 97
crap 97
0 97
otherwise 97
machines 97
disc 97
patient_care 96
fell 96
seems_like 96
multiple_times 96
included 96
control 96
sees 96
every_day 96
family_member 96
collections 96
anyone_looking 96
trained 96
owe 95
establishment 95
would_go 95
confused 95
complain 95
hoping 95
separate 95
require 95
weeks_ago 95
next_time 95
pleasure 95
runs 95
limited 95
scheduled_appointment 95
god 95
manage 95
tough 95
patience 94
recommendations 94
months_later 94
last_visit 94
performed 94
ignored 94
relax 94
uses 94
lifestyle 94
rare 94
minimal 93
never_received 93
nasty 93
much_time 93
comments 93
medical_field 93
proceeded 93
local 93
insisted 93
sending 93
consistently 93
package 92
unacceptable 92
suffered 92
health_issues 92
advanced 92
expecting 92
last_minute 92
conditions 92
two_months 92
stupid 92
sucks 92
example 91
super_nice 91
forte 91
good_experience 91
occasions 91
s 91
sunday 91
chronic_pain 91
buy 91
record 91
male 91
spinal 91
auch 91
eventually 91
extremely_knowledgeable 91
really_care 90
ever_seen 90
feel_rushed 90
holistic 90
speaking 90
absolutely_love 90
confidence 90
bothered 89
hurting 89
thyroid 89
find_another 89
respond 89
root 89
looking_forward 89
new_patients 89
details 89
forced 89
focused 89
activities 89
stating 89
john 89
allergy 89
core_institute 89
lovely 88
whom 88
hearing 88
dentist 88
deep_tissue 88
paper_work 88
greatly 88
weekly 88
thoroughly 88
dave 88
sooner 88
ice 88
started_seeing 88
joe 87
2016 87
worry 87
stick 87
stayed 87
lived 87
reed 87
nevada 87
pool 87
refuse 87
everyday 87
would_take 87
would_need 86
great_service 86
stretch 86
educated 86
go_somewhere_else 86
added 86
coverage 86
/ 86
takes_time 86
setting 86
medicare 86
wrap 86
xray 85
apologized 85
compared 85
failed 85
explains 85
similar 85
breathing 85
zero_stars 85
profession 85
somewhere_else 85
confirm 85
scam 85
sante 85
fabulous 85
board 85
laser 85
welcomed 85
sehr 85
promptly 84
primary_doctor 84
final 84
encouraging 84
july 84
treated_like 84
action 84
minutes_early 84
confirmed 84
many_people 84
managed 84
notes 84
st. 84
wasting 84
january 84
function 84
evening 84
accommodate 83
relieved 83
searching 83
skeptical 83
diet 83
dedicated 83
phenomenal 83
sound 83
afterwards 83
prevent 83
lie 83
detailed 83
migraine 83
wrist 83
spots 82
loud 82
filling 82
worried 82
besides 82
employee 82
respectful 82
every_visit 82
extreme 82
bloodwork 82
showing 82
copy 82
june 81
anywhere 81
hello 81
google 81
hour_wait 81
passionate 81
points 81
headache 81
thursday 81
la 81
picked 81
pain_relief 81
really_cares 81
zen 81
medical_history 81
foothills 81
sell 81
understood 80
jobs 80
say_enough_good_things 80
heat 80
discussed 80
taking_care 80
earth 80
enjoyed 80
scan 80
another_patient 80
blood_test 80
2015 80
hardly 80
trainers 80
never_go 80
luckily 79
thru 79
non 79
still_waiting 79
smith 79
weight_loss 79
assigned 79
walks 79
asthma 79
travel 79
west 79
clue 79
resolved 79
35 79
prefer 79
safe 79
regardless 79
seconds 79
teachers 79
d 79
first_place 79
social 79
vacation 79
comment 79
minutes_late 79
obvious 79
gift 79
assist 79
solution 79
deep_tissue_massage 79
community 78
anyways 78
plans 78
breath 78
weeks_later 78
injection 78
decide 78
michael 78
afford 78
college 78
es 78
admitted 78
zu 78
advise 77
masseuse 77
crying 77
asap 77
t 77
one_thing 77
physiotherapist 77
concentra 77
mary 77
appropriate 77
faxed 77
easier 77
always_friendly 77
good_luck 77
exact 77
movement 77
torn 77
originally 76
never_got 76
aside 76
ive 76
anywhere_else 76
negative_reviews 76
relieve 76
even_know 76
rock 76
handed 76
yrs 76
minimum 76
nightmare 76
closer 76
fever 76
ryan 76
accepted 76
bad_experience 76
feeling_like 75
goal 75
timely_manner 75
na 75
posted 75
awhile 75
pulled 75
flexibility 75
always_feel 75
happening 75
scared 75
ups 75
unique 75
anytime 75
workouts 75
worker 75
best_massage 75
tears 75
names 75
suffer 75
discovered 75
steps 75
ton 75
lower 75
luck 75
pushed 75
country 75
healed 75
3rd 75
jessica 75
lee 74
contract 74
stomach 74
requests 74
april 74
never_go_back 74
never_seen 74
careful 74
opportunity 74
tips 74
perform 74
resolve 74
qualified 74
75 74
would_definitely 74
jeff 74
throat 74
tomorrow 74
xrays 74
spending 74
could_tell 74
yee 74
dropped 73
years_old 73
supplements 73
boy 73
named 73
uncaring 73
downtown 73
performance 73
discharged 73
bonus 73
practitioners 73
deductible 73
lied 73
requires 73
best_part 73
amazed 73
week_later 73
different_doctor 73
usual 73
ein 73
greet 72
regret 72
sales 72
sleeping 72
supportive 72
lazy 72
family_members 72
accurate 72
background 72
knees 72
phones 72
losing 72
poorly 72
good_hands 72
elbow 72
afraid 72
sarah 72
faster 72
constant 72
denied 72
admit 72
told_us 72
hassle 72
handled 72
driving 71
fracture 71
refilled 71
tammy 71
practicing 71
several_months 71
medical_office 71
first_thing 71
workers 71
pushing 71
biggest 71
hurts 71
magic 71
sich 71
arthritis 71
relationship 70
maintenance 70
typically 70
everyone_else 70
nope 70
bottom_line 70
becoming 70
former 70
doug 70
meant 70
cuff 70
pretty_good 70
bad_reviews 70
tend 70
drove 70
extensive 70
petrick 70
facial 70
terms 70
many_patients 70
could_see 70
therapeutic 70
henderson 70
id 70
kindness 70
x 70
miracle 70
2-3 69
arrowhead 69
much_pain 69
unbelievable 69
gp 69
below 69
thats 69
problem_areas 69
finally_found 69
eating 69
according 69
sport 69
developed 69
mesa 69
instructions 69
south 69
window 69
sounds 69
communicate 69
doors 69
industry 69
tuesday 69
english 69
impact 69
hrs 69
good_care 68
members 68
therapies 68
genuinely_cares 68
original 68
11 68
north 68
drop 68
air 68
demeanor 68
horrible_experience 68
year_ago 68
tries 68
attempt 68
wraps 68
higher 68
complaining 68
frustration 68
float 68
unorganized 68
credit_card 68
hospitals 68
mit 68
useless 67
next_appointment 67
anyone_else 67
wtf 67
looks_like 67
even_get 67
finger 67
improving 67
stephanie 67
basis 67
jennifer 67
@ 67
extremely_rude 67
go_elsewhere 67
behavior 67
effect 67
tom 67
inviting 67
staff_member 67
new_primary 67
long_term 67
michelle 67
summer 66
upper 66
understands 66
hours_later 66
woke 66
iv 66
ever_since 66
mouth 66
beat 66
hr 66
warning 66
brown 66
shower 66
suppose 66
terrific 66
view 66
thrilled 66
opening 66
seemed_like 65
tested 65
crowded 65
suggestions 65
quest 65
types 65
flat 65
could_help 65
staff_members 65
medical_issues 65
timely 65
alternative 65
absolutely_amazing 65
never_heard 65
unpleasant 65
attended 65
could_barely 65
brandon 65
relaxation 65
feels_like 65
second_visit 65
empty 65
200 65
weights 65
act 65
messed 65
insurance_companies 64
convenience 64
b 64
style 64
referring 64
quiet 64
chairs 64
getting_better 64
owed 64
de 64
pill 64
consistent 64
really_great 64
solutions 64
consult 64
everybody 64
size 64
stone 64
shit 63
bothering 63
angry 63
replacement 63
pounds 63
count 63
three_years 63
technician 63
three_weeks 63
learning 63
piece 63
18 63
antibiotic 63
kidding 63
cardio 63
rotator 63
significant 63
challenging 63
complained 63
shortly 63
ron 63
unfriendly 63
feedback 63
elderly 63
much_longer 63
doctor_came 63
really_bad 63
yelling 63
manual 63
eos 63
hard_time 63
dom 63
wound 63
courtesy 63
dog 63
established 63
three_months 62
success 62
hey 62
warned 62
station 62
damage 62
puts 62
back_issues 62
assistance 62
fortunate 62
law 62
disorganized 62
pap 62
enjoyable 62
intense 62
thankfully 62
80 61
always_get 61
pull 61
continuing 61
priority 61
successful 61
significantly 61
skill 61
transfer 61
corner 61
strengthen 61
16 61
14 61
strange 61
chat 61
damn 61
cryotherapy 61
mistakes 61
knee_surgery 61
letting 61
approved 61
sadly 61
rescheduled 61
neither 61
brace 61
preventative 61
pharmacist 61
emailed 60
ass 60
pam 60
insurance_card 60
inform 60
somewhat 60
wear 60
one_hour 60
medical_assistants 60
paul 60
apologize 60
next_week 60
adjust 60
emails 60
responsibility 60
somewhere 60
matters 60
rid 60
payments 60
honestly_say 60
checks 60
missing 60
potential 60
march 60
tip 60
miserable 60
claims 60
express 60
knee_replacement 60
director 60
employer 60
apart 60
responded 60
personnel 60
fresh 60
bright 60
expert 60
annoying 60
text 60
wait_another 59
good_thing 59
comprehensive 59
little_bit 59
waiting_time 59
listed 59
pts 59
medical_staff 59
screen 59
continues 59
wait_long 59
disgusting 59
shut 59
switching 59
rn 59
war 59
strengthening 59
reached 59
incompetence 59
updated 59
n 59
took_care 59
would_help 59
lives 59
alot 59
disappointing 59
new_office 59
yearly 59
thus 59
offering 59
fees 58
promised 58
really_helped 58
took_time 58
wall 58
shoes 58
verify 58
dry_needling 58
availability 58
cancellation 58
truly_care 58
entered 58
* 58
perez 58
compare 58
and/or 58
december 58
signing 58
risk 58
teaching 58
pediatrics 58
smiles 58
taken_back 58
für 58
many_doctors 57
big_deal 57
entire_time 57
walk-ins 57
coffee 57
medical_center 57
anybody 57
must_say 57
mountain 57
surgical 57
lift 57
closing 57
awkward 57
never_return 57
shown 57
half_hour 57
talks 57
appts 57
disrespectful 57
ot 57
talented 57
josh 57
ball 57
blame 57
never_get 57
rudely 57
phone_number 57
series 57
den 57
tone 57
go_anywhere_else 57
mat 57
wont 57
shoulder_pain 56
pediatric 56
picture 56
hormones 56
frequently 56
hurry 56
exams 56
advantage 56
boot 56
patel 56
comfort 56
cheaper 56
arriving 56
black 56
bottom 56
attending 56
could_go 56
towels 56
vibe 56
loved_one 56
needle 56
pas 56
deserves 56
source 56
intelligent 56
sample 56
extremely_friendly 56
white 56
released 56
american 56
arms 56
never_ever 56
tsai 56
gyms 56
august 56
october 56
delivered 56
maintain 56
hips 56
signs 56
ailments 56
extended 55
thank_god 55
personalized 55
somehow 55
tea 55
empathy 55
2013 55
individuals 55
refreshing 55
september 55
degree 55
five_minutes 55
worst_experience 55
2012 55
tremendously 55
odd 55
latest 55
recovering 55
explained_everything 55
certified 55
states 55
every_week 55
repeat 55
apt 55
brother 55
anything_else 55
tear 55
comforting 55
left_feeling 55
planning 55
campbell 55
throw 55
plain 55
depending 55
considerate 55
california 55
myers 55
apology 55
let_alone 55
therefore 54
first_experience 54
reviewers 54
pneumonia 54
responsive 54
smiling 54
great_massage 54
introduced 54
starts 54
error 54
attend 54
three_days 54
likes 54
days_ago 54
flow 54
laid 54
remove 54
annoyed 54
hang 54
1.5 54
reply 54
packed 54
bucks 54
red 54
blessed 54
charging 54
yelp_reviews 54
needles 54
backfit 54
nutrition 54
pain_medication 54
auf 54
caught 54
supervisor 54
combination 54
solid 54
sind 54
vu 54
reminder 54
shop 54
additionally 53
everywhere 53
ben 53
gain 53
partner 53
scripts 53
green 53
auto 53
alex 53
reviewed 53
sheet 53
instantly 53
like_family 53
smell 53
internet 53
doctor_would 53
discussing 53
discharge 53
activity 53
journey 53
pricing 53
lay 53
manipulation 53
notified 53
always_takes 53
arrogant 53
prescribing 53
johnson 53
quit 53
assume 53
sincerely 53
kidney 53
new_location 53
teach 53
never_even 53
products 53
technology 52
humor 52
whole_time 52
mayo 52
bringing 52
privacy 52
owners 52
medical_group 52
shane 52
suck 52
jason 52
makes_sure 52
ever_met 52
train 52
daughters 52
cell 52
news 52
wasnt 52
rmts 52
upfront 52
examined 52
amanda 52
regards 52
hill 52
.i 52
code 52
led 52
excellent_care 52
peter 52
well-being 52
first_day 52
valuable 52
considered 52
challenge 52
badly 52
sciatica 52
watching 52
families 52
best_physical 51
girlfriend 51
watched 51
crew 51
well_worth 51
allows 51
tons 51
hire 51
rose 51
park 51
shared 51
sold 51
ongoing 51
m 51
laughed 51
blood_drawn 51
listener 51
cvs 51
achieve 51
random 51
two_different 51
traffic 51
spacious 51
portal 51
replied 51
traditional 51
centre 51
another_office 51
mental 51
distance 51
hall 51
best_care 51
breathe 51
checkup 51
guidance 51
docasar 51
making_sure 51
staying 51
upbeat 51
would_say 51
feel_welcome 50
covers 50
ignore 50
thinks 50
something_else 50
birth 50
addressing 50
2017 50
intake 50
st 50
reduce 50
ultimately 50
recently_moved 50
collect 50
cheap 50
laughing 50
many_different 50
occupational 50
spoken 50
second_opinion 50
loved_ones 50
passion 50
tennis 50
4th 50
encourage 50
unfortunate 50
ears 50
stood 50
gem 50
obgyn 50
registered 50
cleaning 50
lisa 50
dollar 50
schedules 50
joy 50
authorization 49
operation 49
wondering 49
said_yes 49
linda 49
aspects 49
canceled 49
repeatedly 49
fixing 49
wide 49
million 49
charlotte 49
rash 49
hesitate 49
nose 49
bodyworks 49
tendon 49
p.a 49
pack 49
lacking 49
excruciating 49
diagnostic 49
gon 49
recommending 49
mad 49
remembered 49
unethical 49
spooner 49
far_away 49
accessible 49
box 49
bei 49
crystal 49
really_knows 49
would_make 49
annual_physical 49
lopez 49
hormone 48
sinus_infection 48
tiny 48
sensitive 48
side_effects 48
minute_massage 48
nicely 48
sports_medicine 48
occasion 48
death 48
interesting 48
crack 48
decisions 48
dignity 48
equally 48
stitches 48
2014 48
breast 48
parking_lot 48
collection 48
capable 48
seven 48
screwed 48
wednesday 48
personal_training 48
blood_tests 48
go_away 48
athletic 48
straw 48
round 48
feel_great 48
thoughtful 48
next_door 48
everytime 48
que 48
five_stars 48
path 48
ear_infection 48
nur 48
couple_years 48
whatsoever 48
button 48
bones 48
gold 48
held 48
laugh 47
born 47
sparks 47
blood_work_done 47
y 47
long_wait_times 47
fast_forward 47
slightly 47
walls 47
global_chiropractic 47
severe_pain 47
desire 47
looked_like 47
first_class 47
impression 47
medical_practice 47
tables 47
next_morning 47
ashley 47
suddenly 47
familiar 47
orders 47
would_think 47
sends 47
find_another_doctor 47
great_things 47
family_medical 47
attack 47
protocol 47
incorrectly 47
nursing_staff 47
shopping 47
heavy 47
east 47
store 47
kelly 47
btw 47
sbaih 47
reduced 47
um 47
promise 47
acute 47
desperate 47
discount 47
back_problems 47
insurance_would 47
seat 47
draw 47
fired 47
determine 47
educate 47
nicole 47
centers 46
bc 46
rushing 46
would_rather 46
incorrect 46
explain_everything 46
assess 46
13 46
holding 46
unhappy 46
hesitant 46
past_year 46
forgotten 46
nature 46
alleviate 46
fancy 46
carefully 46
november 46
alignment 46
choices 46
statement 46
reaction 46
go_home 46
license 46
teeth 46
hot_yoga 46
decade 46
regular_doctor 46
attempted 46
dismissed 46
delay 46
grandmother 46
lets 46
sincere 46
nicest 46
majority 46
attorney 46
position 46
mix 46
misdiagnosed 46
dead 46
career 46
max 46
education 46
derosa 46
whole_family 45
enter 45
conveniently_located 45
long_story_short 45
exception 45
patient_portal 45
extremely_helpful 45
permanent 45
even_better 45
sweat 45
nemanic 45
bronchitis 45
endurance 45
lights 45
expressed 45
good_reviews 45
next_visit 45
chatting 45
fraud 45
chamian 45
wheelchair 45
wearing 45
replaced 45
repair 45
strep 45
ambulance 45
soft 45
walgreens 45
books 45
4pm 45
lead 45
amy 45
cross 45
movements 45
fear 45
quick_care 45
stressed 45
kinds 45
ask_questions 45
cry 45
weekends 45
could_hear 45
medical_clinic 45
rowena 45
removal 45
appears 45
adult 44
cases 44
really_liked 44
key 44
speed 44
direction 44
take_time 44
diabetes 44
tour 44
explains_everything 44
hotel 44
medically 44
sugar 44
february 44
one_person 44
approximately 44
best_place 44
administrative 44
allergic 44
consideration 44
club 44
really_appreciate 44
central 44
burn 44
internal 44
orthotics 44
fat 44
pointed 44
scheduler 44
nicer 44
impressive 44
threw 44
medical_needs 44
huge_difference 44
unhelpful 44
great_deal 44
reflexology 44
long_waits 44
judge 44
support_staff 44
nasm 44
phillips 44
witnessed 44
reminded 44
fereidouni 44
aber 44
patiently 43
ever_need 43
remembers 43
ortho 43
tice 43
amazingly 43
cast 43
fellow 43
toca 43
truth 43
dry 43
essentially 43
frankly 43
wonders 43
complex 43
shift 43
happily 43
opposite 43
administration 43
initial_visit 43
ugh 43
somebody 43
positive_experience 43
loving 43
knee_pain 43
programs 43
trusted 43
clinical 43
swollen 43
entire_life 43
bs 43
dept 43
disgusted 43
shoulder_injury 43
onto 43
came_across 43
angelo 43
saving 43
describe 43
coach 43
rates 43
rosenstein 43
whole_body 43
functional 43
= 43
sprained 43
month_ago 43
power 43
product 43
allen 43
false 42
bell 42
one_visit 42
holiday 42
look_elsewhere 42
swelling 42
advocate 42
good_things 42
would_see 42
build 42
teacher 42
cards 42
struggling 42
whoever 42
milne 42
3-4 42
sullivan 42
pop 42
jen 42
picky 42
dying 42
parts 42
rated 42
stairs 42
responsible 42
2.5 42
app 42
agency 42
follows 42
institute 42
particularly 42
summerlin 42
organization 42
hooked 42
great_bedside_manner 42
neurologist 42
decor 42
check-in 42
receptionist_said 42
kinda 42
birth_control 42
nurse_practitioners 42
cna 42
le 42
recommend_anyone 42
felt_better 42
500 42
hi 42
pain_stop 42
younger 42
vanessa 42
upon_arrival 42
tools 42
reviewer 42
craig 42
constant_pain 42
testosterone 42
status 41
jones 41
first_session 41
corporate 41
instructed 41
retired 41
thomas 41
one_doctor 41
brief 41
present 41
lungs 41
jump 41
severely 41
setup 41
150 41
dark 41
finally_called 41
ya 41
amazing_staff 41
inconvenience 41
forth 41
sons 41
painless 41
crossfit 41
cure 41
ages 41
admin 41
mid 41
nurse_came 41
loss 41
policies 41
marathon 41
pride 41
hip_pain 41
instruction 41
also_great 41
method 41
month_old 41
omg 41
genuinely_care 41
falling 41
relatively 41
stressful 41
another_hour 41
thumbs 41
depression 41
brent 41
homework 41
elements 41
among 41
one_ever 41
complicated 41
strongly_recommend 41
lasted 41
wachs 41
methods 41
pissed 41
habits 41
act_like 40
hopes 40
lifting 40
drink 40
brain 40
conversations 40
amazing_doctor 40
men 40
upper_back 40
rough 40
papers 40
ekg 40
entirely 40
runner 40
irritated 40
excellent_service 40
asleep 40
pages 40
associates 40
event 40
every_month 40
examine 40
decorated 40
critical 40
grow 40
proactive 40
nerves 40
kann 40
couldnt 40
scary 40
bag 40
studios 40
+ 40
family_doctors 40
one_stop 40
honor 40
hat 40
gladly 40
brand_new 40
faith 40
primary_physician 40
downhill 40
convinced 40
triage 40
imaging 39
lying 39
acl 39
andrew 39
ever_experienced 39
desired 39
cleared 39
died 39
towel 39
hundreds 39
warner 39
great_results 39
heck 39
frequent 39
picking 39
tell_us 39
repeated 39
ins 39
find_someone 39
include 39
situations 39
get_help 39
susan 39
public 39
70 39
urgent_cares 39
approval 39
temporary 39
identify 39
smooth 39
toe 39
shady 39
goodness 39
reception_area 39
maria 39
trash 39
heather 39
actually_care 39
get_seen 39
w 39
einen 39
closest 39
superb 39
jacky 39
bike 39
standards 39
mixed 39
mich 39
mir 39
c 39
300 39
acknowledge 39
requesting 39
make_appointments 39
family_physicians 39
prescription_refill 39
medical_facility 39
fmla 39
circumstances 38
pleasant_experience 38
financial 38
drug_test 38
5pm 38
regular_basis 38
purpose 38
great_doctors 38
items 38
screening 38
never_felt_rushed 38
roll 38
dermatologist 38
examining 38
healing_process 38
yelpers 38
trauma 38
catch 38
blessing 38
threatening 38
every_step 38
outcome 38
attempts 38
cleaned 38
gut 38
nearby 38
seem_like 38
healthier 38
ever_go 38
performing 38
walker 38
could_take 38
real_doctor 38
sauna 38
insurances 38
preferred 38
bed_side 38
empathetic 38
resulted 38
documents 38
created 38
weak 38
andrea 38
good_job 38
great_customer_service 38
print 38
select 38
amazing_experience 38
tim 38
diagnoses 38
synergy 38
cortisone 38
next_patient 38
even_bother 38
requiring 38
two_visits 38
doctors_offices 38
trigger_point 38
adequate 38
medical_board 38
running_late 38
health_care_provider 37
believed 37
best_thing 37
one_else 37
eye_contact 37
really_appreciated 37
cheerful 37
really_know 37
purchase 37
worth_every 37
great_reviews 37
accordingly 37
degrees 37
numbers 37
model 37
really_need 37
drew 37
best_chiropractor 37
bank 37
health_concerns 37
sudden 37
movie 37
fight 37
excuses 37
medical_professional 37
practically 37
paige 37
importance 37
cream 37
motivated 37
shock 37
cattle 37
always_willing 37
stiff 37
hallway 37
nick 37
last_night 37
1000 37
steroid 37
harder 37
aggressive 37
nagging 37
connected 37
remind 37
solve 37
christmas 37
joined 37
drawn 37
co_pay 37
feelings 37
star_rating 37
row 37
causes 37
calming 37
full_body 37
never_experienced 37
pros 37
amazing_job 37
400 37
item 37
samples 37
two_stars 37
mill 37
charts 37
sun 37
golf 37
stroke 37
work_done 37
determined 37
coworker 37
could_use 37
toward 37
carry 37
indeed 37
knee_injury 36
includes 36
questioned 36
wonderful_doctor 36
chain 36
jordan 36
couple_weeks 36
botox 36
greeting 36
danny 36
joints 36
directed 36
kick 36
rocks 36
360 36
deliver 36
19 36
fingers 36
look_like 36
nice_enough 36
moves 36
ct 36
front_desk_lady 36
encouragement 36
rip 36
priced 36
interaction 36
band 36
screaming 36
also_told 36
larger 36
two_times 36
filed 36
hole 36
eager 36
pushy 36
clueless 36
crappy 36
hanging 36
accidents 36
shoulder_surgery 36
fortunately 36
one_session 36
companies 36
pays 36
fail 36
poor_customer_service 36
assumed 36
turning 36
brian 36
tremendous 36
increased 36
obtain 36
back_office 36
kimberly 36
competitive 36
swedish 36
outrageous 36
season 36
couples 36
minute_wait 36
designed 36
brilliant 36
treatment_options 36
mild 36
showers 36
17 36
choosing 36
caring_staff 36
swear 36
would_probably 36
herniated 36
partners 36
lastly 36
come_across 36
back_surgery 36
blah 36
hesitation 36
diabetic 36
pellets 36
friend_recommended 35
family_physician 35
richard 35
walk_ins 35
feeling_great 35
ob 35
glendale 35
licensed 35
pleasantly_surprised 35
slowly 35
intuitive 35
naturally 35
electronic 35
pro 35
overwhelmed 35
short_time 35
never_met 35
doctor_said 35
cup 35
hip_replacement 35
pain_level 35
physicals 35
takes_care 35
attitudes 35
8am 35
kudos 35
cozy 35
mechanics 35
encouraged 35
duty 35
establish 35
p.s 35
people_like 35
butt 35
bigger 35
panic 35
unbelievably 35
without_even 35
last_appointment 35
impatient 35
numerous_times 35
corrected 35
understaffed 35
sore_throat 35
every_patient 35
g 35
vein 35
jackson 35
planned 35
stellar 35
palmer 35
regain 35
party 35
48 35
rob 35
really_listen 35
speaks 35
doesnt 35
life_back 35
reviewing 35
comes_back 35
pretty_sure 35
uti 35
acceptable 35
short_notice 35
greatest 35
robertson 35
ray 35
entire_family 35
babies 35
dosage 35
tag 35
security 35
demand 35
submitted 35
cons 35
could_make 34
one_week 34
a+ 34
10-15 34
another_one 34
2pm 34
restroom 34
subsequent 34
throwing 34
occurred 34
foothills_sports_medicine 34
earned 34
gave_us 34
southern 34
printed 34
insurance_information 34
radio 34
respiratory 34
pre 34
karen 34
k 34
new_patient_paperwork 34
york 34
firm 34
proof 34
good_doctors 34
don 34
ride 34
reasonably 34
confirmation 34
improvements 34
busy_schedule 34
east_valley 34
cholesterol 34
actual_doctor 34
cat 34
get_called_back 34
nights 34
acknowledged 34
co-pays 34
reported 34
locked 34
efficiently 34
kevin 34
even_worse 34
perfectly 34
could_care_less 34
waits 34
rainbow 34
previous_review 34
floors 34
feel_good 34
wu 34
knew_exactly 34
blood_draw 34
us_back 34
i.e 34
kyle 34
schedule_appointments 34
stewart 34
first_impression 34
bleeding 34
relieving 34
smoothly 34
countless 33
submit 33
office_called 33
office_visits 33
permission 33
medicines 33
year_old_son 33
e 33
per_week 33
sorts 33
overall_health 33
ibuprofen 33
great_team 33
vertigo 33
meaning 33
dismissive 33
language 33
manners 33
medical_professionals 33
verified 33
penny 33
always_leave 33
explain_things 33
jimmy 33
feeling_well 33
traveling 33
wellness_center 33
icu 33
really_enjoyed 33
cute 33
adjusting 33
aspect 33
soreness 33
winter 33
cutting 33
skip 33
great_chiropractor 33
peace 33
evaluate 33
recommend_going 33
failure 33
thoughts 33
tops 33
maintained 33
university 33
regard 33
soft_tissue 33
return_calls 33
san 33
great_office 33
15-20 33
useful 33
smells 33
tense 33
tunnel 33
scar_tissue 33
never_feel_rushed 33
inflammation 33
faz 33
exceptionally 33
ann 33
posting 33
mood 33
urgency 33
mentally 33
deals 33
orthopedic_surgeon 33
couple_months 33
running_behind 33
fire 33
create 33
trial 33
praxis 33
hier 33
acted_like 33
bar 33
smaller 33
meanwhile 33
dean 33
sie 33
5-10 33
dance 33
stiffness 33
headed 33
von 33
emotional 33
handful 32
nowhere 32
associated 32
soooo 32
con 32
gentleman 32
temperature 32
one_month 32
numbness 32
bp 32
give_us 32
sam 32
two_people 32
garbage 32
physician_assistant 32
locker 32
whose 32
praise 32
terrible_experience 32
3pm 32
professionally 32
shorter 32
horribly 32
wonderful_experience 32
race 32
great_work 32
new_person 32
yoga_studio 32
quote 32
rep 32
hungry 32
pain-free 32
bend 32
ground 32
appeared 32
kicked 32
whole_experience 32
high_school 32
lbs 32
squeeze 32
rd 32
gross 32
narcotics 32
term 32
ailment 32
diagnosing 32
reformer 32
month_later 32
bottle 32
apparent 32
good_experiences 32
confusing 32
occasionally 32
breaking 32
careless 32
study 32
passing 32
highest 32
refuses 32
base 32
senior 32
saturdays 32
five_years 32
wake 32
brings 32
bad_experiences 32
vaccines 32
pinched 32
wynn 32
claimed 32
rehab_plus 32
absolutely_horrible 31
rudest 31
personal_attention 31
three_hours 31
legal 31
nothing_wrong 31
cornerstone 31
cured 31
stimulation 31
coughing 31
king 31
davis 31
confusion 31
http 31
initial_consultation 31
played 31
rely 31
addresses 31
parent 31
envy 31
successfully 31
6pm 31
force 31
inquire 31
screw 31
run_around 31
extra_mile 31
guide 31
money_back 31
get_sick 31
already_paid 31
melissa 31
started_coming 31
wfp 31
surgeons 31
front_desk_girl 31
inhaler 31
l 31
answer_questions 31
frame 31
9am 31
dedication 31
mainly 31
appear 31
quality_care 31
breeze 31
yr 31
megan 31
gal 31
austin 31
va 31
abdominal 31
jerk 31
strep_throat 31
applied 31
errors 31
tests_done 31
rude_staff 31
canyon 31
many_chiropractors 31
mall 31
last_month 31
work_schedule 31
anthem 31
lifetime 31
inches 31
limitations 31
mediocre 31
habe 31
concierge 31
als 31
blown_away 31
fiance 31
everything_else 31
southwest 31
businesses 31
calf 31
tightness 31
acts 30
gained 30
granted 30
sinus 30
infections 30
also_love 30
oriented 30
bedside_manners 30
4:30 30
respected 30
glasses 30
friendliness 30
introduce 30
waltman 30
couple_days 30
dana 30
discussion 30
informing 30
cardiologist 30
dangerous 30
rapid 30
sara 30
sue 30
ta 30
portion 30
fry 30
shea 30
laying 30
fake 30
pulling 30
poses 30
rolled 30
naturopathic 30
horrible_service 30
depth 30
blew 30
upstairs 30
cancelling 30
afterward 30
new_insurance 30
aunt 30
recovered 30
strain 30
spas 30
suggestion 30
join 30
noch 30
strongly 30
neighborhood 30
route 30
mammogram 30
valued 30
plantar 30
need_help 30
freaking 30
great_people 30
reports 30
drops 30
without_pain 30
decompression 30
well_taken_care 30
johnston 30
turnover 30
ignite 30
reddy 30
incident 30
physiotherapists 30
staffed 30
increase 30
birthday 30
yelled 30
golds 30
rules 30
moody 30
ok. 30
develop 30
coury 30
demanded 30
exceeded 30
craft 30
secretary 30
williams 30
accepting_new_patients 30
care_physician 30
riley 30
vitamin 30
liu 29
built 29
also_gave 29
concept 29
huh 29
idiot 29
struggled 29
ahwatukee 29
never_going_back 29
fractured 29
in-house 29
dose 29
guarantee 29
spanish 29
go_get 29
restaurant 29
vista 29
engaging 29
first_treatment 29
optimal 29
apply 29
engaged 29
un 29
utmost 29
tailored 29
ends 29
indicated 29
queen 29
frank 29
oil 29
yay 29
horrendous 29
peaceful 29
deeply 29
say_anything 29
lesson 29
grab 29
affiliated 29
yelp_review 29
adding 29
baker 29
allowing 29
suit 29
disability 29
luke 29
combined 29
day_one 29
kinks 29
joseph 29
kindred 29
evaluated 29
rachel 29
clothes 29
turned_away 29
files 29
guessing 29
bodies 29
dem 29
rushes 29
opted 29
inappropriate 29
biltmore 29
excellent_job 29
casey 29
hidden 29
gloves 29
sets 29
opinions 29
argued 29
match 29
mehr 29
entrance 29
really_want 29
cindy 29
ridge 29
wie 29
less_pain 29
onsite 29
assuming 29
b/c 29
dropping 29
spasms 29
cigna 29
labor 29
periods 28
pricey 28
many_things 28
get_results 28
week_ago 28
gifted 28
entering 28
maximum 28
committed 28
aka 28
reminders 28
terribly 28
ripped 28
hills 28
roof 28
specializes 28
understandable 28
sciatic 28
reassuring 28
block 28
threatened 28
aid 28
acting 28
need_physical_therapy 28
wellbeing 28
hired 28
resort 28
9:30 28
lyme 28
grandma 28
several_different 28
subway 28
unit 28
cane 28
snacks 28
equipped 28
reporting 28
reliable 28
complications 28
mile 28
wendy 28
serve 28
longest 28
noise 28
addict 28
foods 28
declined 28
trips 28
mal 28
vomiting 28
faces 28
growing 28
spend_time 28
shout 28
eight 28
e-mail 28
creek 28
rib 28
voicemails 28
swenson 28
nach 28
things_like 28
sharing 28
parker 28
tb 28
mitch 28
get_blood 28
amounts 28
20-30 28
cuz 28
guest 28
ratings 28
podiatrist 28
massaging 28
massaged 28
comp 28
argue 28
fly 28
cleanliness 28
fed 28
outpatient 28
modalities 28
myofascial 28
copies 28
dann 28
certificate 28
difficulty 28
nv 28
events 28
ent 28
legit 27
approx 27
people_waiting 27
selling 27
thousands 27
burning 27
sheets 27
web 27
29 27
encounter 27
emergencies 27
sounded 27
love_love 27
long-term 27
contacting 27
ring 27
ross 27
delivery 27
guided 27
.and 27
controlled 27
leading 27
dye 27
finds 27
refusing 27
disappeared 27
buying 27
goodbye 27
trigger 27
renewed 27
turner 27
identified 27
debbie 27
generous 27
noon 27
warn 27
functioning 27
also_like 27
completing 27
impersonal 27
totum 27
fits 27
sean 27
accepting 27
rendered 27
eine 27
zeit 27
crutches 27
felt_comfortable 27
soothing 27
overly 27
copays 27
unbearable 27
hamstring 27
christopher 27
ignorant 27
dozen 27
discs 27
chad 27
continually 27
smear 27
schon 27
hated 27
filthy 27
pray 27
wash 27
grown 27
prepare 27
greets 27
office_hours 27
norton 27
overnight 27
dream 27
surprisingly 27
tissue 27
2011 27
par 27
bulging 27
abnormal 27
vet 27
3:30 27
individualized 27
pa-c 27
alicia 27
heidi 27
tafreshi 27
kindly 26
actively 26
feel_much_better 26
staffs 26
existing 26
check-up 26
ordering 26
superior 26
sharp 26
strip 26
decline 26
groups 26
effects 26
loudly 26
raise 26
practical 26
jokes 26
tolerate 26
inquired 26
horrific 26
moments 26
ache 26
receipt 26
toddler 26
glass 26
pathetic 26
fucking 26
section 26
pure 26
representative 26
zocdoc 26
version 26
pee 26
loose 26
wheel 26
would_work 26
asking_questions 26
tonight 26
idiots 26
scale 26
always_helpful 26
managing 26
integrity 26
feeling_much_better 26
something_wrong 26
exercising 26
clientele 26
stories 26
bedside 26
settled 26
place_like 26
steven 26
hoped 26
first_one 26
sweetest 26
generic 26
military 26
video 26
95 26
would_cost 26
cohen 26
approached 26
master 26
never_done 26
fyzical 26
driven 26
science 26
depends 26
numb 26
approachable 26
processed 26
stepped 26
court 26
koch 26
quoted 26
go-to 26
adam 26
hogan 26
boys 26
enjoys 26
hard_work 26
ms. 26
believer 26
excessive 26
grace 26
55 26
task 26
telephone 26
chances 26
hatfield 26
convince 26
quicker 26
naturopath 26
collecting 26
mettler 26
